import os
print("当前工作目录:", os.getcwd())
DIM_INFO = [
    # ================== 经济维度 ==================
    (
        "经济", 
        [1, 2, 3, 4],   # 指标编号：GDP总量、人均GDP、第三产业占比、能源消费总量、单位GDP碳排放强度
        [1, 1, 1, 1]    # 方向：正向↑, 正向↑, 正向↑, 负向↓, 负向↓
    ),
    
    # ================== 工业维度 ==================
    (
        "工业", 
        [6, 7, 8, 9, 10],  # 指标编号：工业增加值、高耗能行业占比、单位工业能耗、工业碳排放、工业清洁能源
        [1, 1, 1, 1, 1]    # 方向：正向↑, 负向↓, 负向↓, 负向↓, 正向↑
    ),
    
    # ================== 农业维度 ==================
    (
        "农业", 
        [11, 12, 13, 14, 15],  # 指标编号：农业总产值、化肥用量、秸秆利用率、畜牧碳排放、机械化率
        [1, 1, 1, 1, 1]        # 方向：正向↑, 负向↓, 正向↑, 负向↓, 正向↑
    ),
    
    # ================= 居民生活维度 ================
    (
        "居民生活", 
        [16, 17, 18, 19, 20],  # 指标编号：人口总数、可支配收入、生活用电、汽车保有量、供暖排放
        [1, 1, 1, 1, 1]        # 方向：中性→(暂设为负向), 正向↑, 负向↓, 负向↓, 负向↓
                                # 注：人口总数可根据研究目标调整为中性（需特殊处理）
    ),
    
    # ================= 碳中和维度 ==================
    (
        "碳排放", 
        [4, 5, 7, 8, 9, 10, 12, 13, 14, 18, 19, 20],  #指标编号
        [1, 1, 1, 1, 1, 0, 1, 0, 1, 1, 1, 1]          #方向
        # 对应指标：能源总量0、GDP碳强0、高耗能占比0、工业能耗0、工业碳排0、清洁能源0、化肥用量、秸秆利用、畜牧碳排、生活用电、汽车保有、供暖排放
    )
]